---
title: ScheduleViewFailures
classe: Autodesk.Revit.DB.BuiltInFailures+ScheduleViewFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 14
---

# ScheduleViewFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId BadViewType { get; }` | `ScheduleViewFailures.BadViewType` | FailureDefinitionId |
| `FailureDefinitionId CannotResizeColumn { get; }` | `ScheduleViewFailures.CannotResizeColumn` | FailureDefinitionId |
| `FailureDefinitionId ColumnsExceedSegment { get; }` | `ScheduleViewFailures.ColumnsExceedSegment` | FailureDefinitionId |
| `FailureDefinitionId ColumnsExcluded { get; }` | `ScheduleViewFailures.ColumnsExcluded` | FailureDefinitionId |
| `FailureDefinitionId CustomFieldNecessaryIdDeleted { get; }` | `ScheduleViewFailures.CustomFieldNecessaryIdDeleted` | FailureDefinitionId |
| `FailureDefinitionId DuplicateFieldRemovedFromKeySchedule { get; }` | `ScheduleViewFailures.DuplicateFieldRemovedFromKeySchedule` | FailureDefinitionId |
| `FailureDefinitionId NoColumnsJoinedToGridLines { get; }` | `ScheduleViewFailures.NoColumnsJoinedToGridLines` | FailureDefinitionId |
| `FailureDefinitionId NotGridName { get; }` | `ScheduleViewFailures.NotGridName` | FailureDefinitionId |
| `FailureDefinitionId PanelScheduleDataPanelSlotInconsistency { get; }` | `ScheduleViewFailures.PanelScheduleDataPanelSlotInconsistency` | FailureDefinitionId |
| `FailureDefinitionId PanelScheduleLoadClassInconsistency { get; }` | `ScheduleViewFailures.PanelScheduleLoadClassInconsistency` | FailureDefinitionId |
| `FailureDefinitionId PanelScheduleSlotInconsistency { get; }` | `ScheduleViewFailures.PanelScheduleSlotInconsistency` | FailureDefinitionId |
| `FailureDefinitionId PanelScheduleSwitchboardSlotInconsistency { get; }` | `ScheduleViewFailures.PanelScheduleSwitchboardSlotInconsistency` | FailureDefinitionId |
| `FailureDefinitionId SchedulesCanBePlacedOnSheetsOnly { get; }` | `ScheduleViewFailures.SchedulesCanBePlacedOnSheetsOnly` | FailureDefinitionId |
| `FailureDefinitionId SegmentsStartIsGreaterThanSegmentsEnd { get; }` | `ScheduleViewFailures.SegmentsStartIsGreaterThanSegmentsEnd` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```